Revit 2027 API
Rebar.EnableHookLengthOverride Method
 Enables or disables the ability to override hook lengths for this rebar instance.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void EnableHookLengthOverride(
	bool enable
)
Public Sub EnableHookLengthOverride (
	enable As Boolean
)
public:
void EnableHookLengthOverride(
	bool enable
)
member EnableHookLengthOverride :
        enable : bool -> unit
Parameters
enable Boolean
 True to enable, False to disable.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace